<a href="https://colab.research.google.com/github/rtiwari5317/ML-Projects/blob/master/Data_Analysis_NBA_Players_Kaggle_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [25]:
#Importing the Necessary Libraries
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [26]:
file_path = '/content/'
df = pd.read_csv(file_path+'NBA_season1718_salary.csv')
df.head(5)

           Player Team Name  Season17_18
0   Stephen Curry       GSW     34682550
1    LeBron James       CLE     33285709
2    Paul Millsap       DEN     31269231
3  Gordon Hayward       BOS     29727900
4   Blake Griffin       DET     29512900

In [27]:
#First of All Some very Basic Steps: 1)Exploring the Shape,Statistics of the Dataset.
df.shape

(573, 3)

In [5]:
#Some More Info on our Data-Set.
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 573 entries, 0 to 572
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Player       573 non-null    object
 1   Team Name    573 non-null    object
 2   Season17_18  573 non-null    int64
dtypes: int64(1), object(2)
memory usage: 13.6+ KB

In [28]:
#Transforming the Salary Column in correct Format for more readability:
df['Season17_18'] = round(df['Season17_18']/1000000,2)

In [29]:
#Col Rename:
df = df.rename(columns = {'Season17_18':'Salary(Million$)',
                          'Team Name':'Team'})

In [30]:
df.head(5)

           Player Team  Salary(Million$)
0   Stephen Curry  GSW             34.68
1    LeBron James  CLE             33.29
2    Paul Millsap  DEN             31.27
3  Gordon Hayward  BOS             29.73
4   Blake Griffin  DET             29.51

In [9]:
#General Statistical Terms of Our DataSet.
df.describe()

       Salary(Million$)
count        573.000000
mean           5.858796
std            7.162293
min            0.020000
25%            1.310000
50%            2.390000
75%            7.940000
max           34.680000

In [32]:
#How many number of Teams are participating this season?
df['Team'].nunique()

30

In [34]:
#Budget for the Highest and Lowest Team?
#5 Teams with lowest budget 
df.groupby('Team').sum().sort_values(by = 'Salary(Million$)',ascending = False).tail(5)

      Salary(Million$)
Team
SAC              95.63
PHO              94.81
IND              94.44
CHI              89.43
DAL              85.81

In [12]:
#5 Teams with Highest Budget:
df.groupby('Team').sum().sort_values(by = 'Salary(Million$)',ascending = False).head(5)

      Salary(Million$)
Team
GSW             137.50
CLE             137.30
OKC             134.28
MIA             131.22
WAS             124.16